import _ from 'lodash';
/*
Вспомогательная функция. Принимает текущий state и объект со значениями, которые нужно обновить.
Копирует старый state в новый объект. Добавляет в новый объект новые значения
и возвращает новый объект.

P.S.: Использую функцию из библиотеки лодаш cloneDeep для глубокого копирования объекта
на случай если в будущем state разрастется и превратится в многоуровневый объект.
В принципе для одноуровнего объекта cloneDeep не нужен.
*/

const updateObject = (oldObject, updatedValues) => (
  {
    ..._.cloneDeep(oldObject),
    ...updatedValues,
  }
);

export default updateObject;
